luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TPESTS */
#define IFX_ETH_DEBUG_TPESTS_OFF (16u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TRCSTS */
#define IFX_ETH_DEBUG_TRCSTS_LEN (2u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TRCSTS */
#define IFX_ETH_DEBUG_TRCSTS_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TRCSTS */
#define IFX_ETH_DEBUG_TRCSTS_OFF (20u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TWCSTS */
#define IFX_ETH_DEBUG_TWCSTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TWCSTS */
#define IFX_ETH_DEBUG_TWCSTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TWCSTS */
#define IFX_ETH_DEBUG_TWCSTS_OFF (22u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TXFSTS */
#define IFX_ETH_DEBUG_TXFSTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TXFSTS */
#define IFX_ETH_DEBUG_TXFSTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TXFSTS */
#define IFX_ETH_DEBUG_TXFSTS_OFF (24u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TXPAUSED */
#define IFX_ETH_DEBUG_TXPAUSED_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TXPAUSED */
#define IFX_ETH_DEBUG_TXPAUSED_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TXPAUSED */
#define IFX_ETH_DEBUG_TXPAUSED_OFF (19u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_OFF (25u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_LEN (1u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_OFF (7u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_LEN (1u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_OFF (0u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_LEN (2u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_OFF (4u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_LEN (16u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_MSK (0xffffu)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_OFF (16u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_LEN (1u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_OFF (2u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_LEN (1u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_OFF (1u)

/** \brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_LEN (1u)

/** \brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_OFF (3u)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_LEN (4u)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_MSK (0xfu)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_OFF (2u)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_LEN (1u)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_OFF (0u)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_LEN (5u)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_MSK (0x1fu)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_OFF (6u)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_LEN (1u)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_OFF (1u)

/** \brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_LEN (5u)

/** \brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_MSK (0x1fu)

/** \brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_OFF (11u)

/** \brief  Length for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_LEN (16u)

/** \brief  Mask for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_MSK (0xffffu)

/** \brief  Offset for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_OFF (0u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_OFF (0u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_OFF (20u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_OFF (2u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_MSK (0x3u)

