luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_OFF (4u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_OFF (6u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_OFF (8u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_OFF (10u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_OFF (12u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_OFF (14u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_OFF (16u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_LEN (2u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_OFF (18u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.DIV */
#define IFX_ETH_GPCTL_DIV_LEN (1u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.DIV */
#define IFX_ETH_GPCTL_DIV_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.DIV */
#define IFX_ETH_GPCTL_DIV_OFF (25u)

/** \brief  Length for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_LEN (1u)

/** \brief  Mask for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_OFF (24u)

/** \brief  Length for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_LEN (32u)

/** \brief  Mask for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_OFF (0u)

/** \brief  Length for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_LEN (32u)

/** \brief  Mask for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_OFF (0u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.ACTPHYIF */
#define IFX_ETH_HW_FEATURE_ACTPHYIF_LEN (3u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.ACTPHYIF */
#define IFX_ETH_HW_FEATURE_ACTPHYIF_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.ACTPHYIF */
#define IFX_ETH_HW_FEATURE_ACTPHYIF_OFF (28u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.ADDMACADRSEL */
#define IFX_ETH_HW_FEATURE_ADDMACADRSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.ADDMACADRSEL */
#define IFX_ETH_HW_FEATURE_ADDMACADRSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.ADDMACADRSEL */
#define IFX_ETH_HW_FEATURE_ADDMACADRSEL_OFF (5u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.AVSEL */
#define IFX_ETH_HW_FEATURE_AVSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.AVSEL */
#define IFX_ETH_HW_FEATURE_AVSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.AVSEL */
#define IFX_ETH_HW_FEATURE_AVSEL_OFF (15u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.EEESEL */
#define IFX_ETH_HW_FEATURE_EEESEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.EEESEL */
#define IFX_ETH_HW_FEATURE_EEESEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.EEESEL */
#define IFX_ETH_HW_FEATURE_EEESEL_OFF (14u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.ENHDESSEL */
#define IFX_ETH_HW_FEATURE_ENHDESSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.ENHDESSEL */
#define IFX_ETH_HW_FEATURE_ENHDESSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.ENHDESSEL */
#define IFX_ETH_HW_FEATURE_ENHDESSEL_OFF (24u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.EXTHASHEN */
#define IFX_ETH_HW_FEATURE_EXTHASHEN_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.EXTHASHEN */
#define IFX_ETH_HW_FEATURE_EXTHASHEN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.EXTHASHEN */
#define IFX_ETH_HW_FEATURE_EXTHASHEN_OFF (3u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.FLEXIPPSEN */
#define IFX_ETH_HW_FEATURE_FLEXIPPSEN_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.FLEXIPPSEN */
#define IFX_ETH_HW_FEATURE_FLEXIPPSEN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.FLEXIPPSEN */
#define IFX_ETH_HW_FEATURE_FLEXIPPSEN_OFF (26u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.GMIISEL */
#define IFX_ETH_HW_FEATURE_GMIISEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.GMIISEL */
#define IFX_ETH_HW_FEATURE_GMIISEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.GMIISEL */
#define IFX_ETH_HW_FEATURE_GMIISEL_OFF (1u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.HASHSEL */
#define IFX_ETH_HW_FEATURE_HASHSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.HASHSEL */
#define IFX_ETH_HW_FEATURE_HASHSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.HASHSEL */
#define IFX_ETH_HW_FEATURE_HASHSEL_OFF (4u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.HDSEL */
#define IFX_ETH_HW_FEATURE_HDSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.HDSEL */
#define IFX_ETH_HW_FEATURE_HDSEL_MSK (0x1u)

