luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPERFIS_OFF (11u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPEROIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPEROIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPEROIS_OFF (27u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGFIS_OFF (10u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGOIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGOIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXTCPGOIS_OFF (26u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPERFIS_OFF (9u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPEROIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPEROIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPEROIS_OFF (25u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGFIS_OFF (8u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGOIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGOIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXUDPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXUDPGOIS_OFF (24u)

/** \brief  Length for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX1024TMAXOCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX1024TMAXOCTGBFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX1024TMAXOCTGBFIM_OFF (16u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX128T255OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX128T255OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX128T255OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX128T255OCTGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX128T255OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX128T255OCTGBFIM_OFF (13u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX256T511OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX256T511OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX256T511OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX256T511OCTGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX256T511OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX256T511OCTGBFIM_OFF (14u)

/** \brief  Length for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX512T1023OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX512T1023OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX512T1023OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX512T1023OCTGBFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX512T1023OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX512T1023OCTGBFIM_OFF (15u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX64OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX64OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX64OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX64OCTGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX64OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX64OCTGBFIM_OFF (11u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX65T127OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX65T127OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX65T127OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX65T127OCTGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RX65T127OCTGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RX65T127OCTGBFIM_OFF (12u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXALGNERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXALGNERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXALGNERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM_OFF (6u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXBCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXBCGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXBCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXBCGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXBCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXBCGFIM_OFF (3u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCRCERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM_LEN (1u)

