luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCRCERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCRCERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM_OFF (5u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCTRLFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCTRLFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCTRLFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCTRLFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXCTRLFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXCTRLFIM_OFF (25u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXFOVFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXFOVFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXFOVFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM_OFF (21u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBFRMIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBFRMIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBFRMIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM_OFF (0u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBOCTIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBOCTIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGBOCTIM_OFF (1u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGOCTIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGOCTIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXGOCTIM_OFF (2u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXJABERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXJABERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXJABERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXJABERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXJABERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXJABERFIM_OFF (8u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXLENERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXLENERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXLENERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXLENERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXLENERFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXLENERFIM_OFF (18u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXMCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXMCGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXMCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXMCGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXMCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXMCGFIM_OFF (4u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXORANGEFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXORANGEFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXORANGEFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXORANGEFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXORANGEFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXORANGEFIM_OFF (19u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXOSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXOSIZEGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXOSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXOSIZEGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXOSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXOSIZEGFIM_OFF (10u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXPAUSFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXPAUSFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXPAUSFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXPAUSFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXPAUSFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXPAUSFIM_OFF (20u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRCVERRFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRCVERRFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRCVERRFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRCVERRFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRCVERRFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRCVERRFIM_OFF (24u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRUNTFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRUNTFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRUNTFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRUNTFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXRUNTFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXRUNTFIM_OFF (7u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUCGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM_OFF (17u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUSIZEGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUSIZEGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXUSIZEGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXUSIZEGFIM_OFF (9u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXVLANGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXVLANGBFIM_LEN (1u)

