luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXVLANGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXVLANGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXVLANGBFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXVLANGBFIM_OFF (22u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXWDOGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXWDOGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXWDOGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXWDOGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits.RXWDOGFIM */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_MASK_RXWDOGFIM_OFF (23u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX1024TMAXOCTGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX1024TMAXOCTGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX1024TMAXOCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX1024TMAXOCTGBFIS_OFF (16u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX128T255OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX128T255OCTGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX128T255OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX128T255OCTGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX128T255OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX128T255OCTGBFIS_OFF (13u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX256T511OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX256T511OCTGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX256T511OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX256T511OCTGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX256T511OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX256T511OCTGBFIS_OFF (14u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX512T1023OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX512T1023OCTGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX512T1023OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX512T1023OCTGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX512T1023OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX512T1023OCTGBFIS_OFF (15u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX64OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX64OCTGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX64OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX64OCTGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX64OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX64OCTGBFIS_OFF (11u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RX65T127OCTGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RX65T127OCTGBFIS_OFF (12u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXALGNERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXALGNERFIS_OFF (6u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXBCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXBCGFIS_OFF (3u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCRCERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCRCERFIS_OFF (5u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXCTRLFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXCTRLFIS_OFF (25u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXFOVFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXFOVFIS_OFF (21u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBFRMIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBFRMIS_OFF (0u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGBOCTIS_OFF (1u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXGOCTIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXGOCTIS_OFF (2u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXJABERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXJABERFIS_OFF (8u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXLENERFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXLENERFIS_OFF (18u)

