luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXMCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXMCGFIS_OFF (4u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXORANGEFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXORANGEFIS_OFF (19u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXOSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXOSIZEGFIS_OFF (10u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXPAUSFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXPAUSFIS_OFF (20u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRCVERRFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRCVERRFIS_OFF (24u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXRUNTFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXRUNTFIS_OFF (7u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUCGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUCGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUCGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUCGFIS_OFF (17u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUSIZEGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUSIZEGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXUSIZEGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXUSIZEGFIS_OFF (9u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXVLANGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXVLANGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXVLANGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXVLANGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXVLANGBFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXVLANGBFIS_OFF (22u)

/** \brief  Length for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXWDOGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXWDOGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXWDOGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXWDOGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits.RXWDOGFIS */
#define IFX_ETH_MMC_RECEIVE_INTERRUPT_RXWDOGFIS_OFF (23u)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX1024TMAXOCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX1024TMAXOCTGBFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX1024TMAXOCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX1024TMAXOCTGBFIM_OFF (9u)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX128T255OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX128T255OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX128T255OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX128T255OCTGBFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX128T255OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX128T255OCTGBFIM_OFF (6u)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX256T511OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX256T511OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX256T511OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX256T511OCTGBFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX256T511OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX256T511OCTGBFIM_OFF (7u)

/** \brief  Length for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX512T1023OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX512T1023OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX512T1023OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX512T1023OCTGBFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX512T1023OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX512T1023OCTGBFIM_OFF (8u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX64OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX64OCTGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX64OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX64OCTGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX64OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX64OCTGBFIM_OFF (4u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX65T127OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX65T127OCTGBFIM_LEN (1u)

