luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX65T127OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX65T127OCTGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TX65T127OCTGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TX65T127OCTGBFIM_OFF (5u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGBFIM_OFF (12u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXBCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXBCGFIM_OFF (2u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXCARERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXCARERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXCARERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXCARERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXCARERFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXCARERFIM_OFF (19u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXDEFFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXDEFFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXDEFFIM_OFF (16u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXCOLFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXCOLFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXCOLFIM_OFF (18u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXDEFFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXDEFFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXEXDEFFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXEXDEFFIM_OFF (22u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBFRMIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBFRMIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBFRMIM_OFF (1u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBOCTIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBOCTIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGBOCTIM_OFF (0u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGFRMIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM_OFF (21u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGOCTIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGOCTIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXGOCTIM_OFF (20u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXLATCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXLATCOLFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXLATCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXLATCOLFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXLATCOLFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXLATCOLFIM_OFF (17u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGBFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGBFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGBFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGBFIM_OFF (11u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCGFIM_OFF (3u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCOLGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits.TXMCOLGFIM */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_MASK_TXMCOLGFIM_MSK (0x1u)

