luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXBCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXBCGFIS_OFF (2u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXCARERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXCARERFIS_OFF (19u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXDEFFIS_OFF (16u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXCOLFIS_OFF (18u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXEXDEFFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXEXDEFFIS_OFF (22u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBFRMIS_OFF (1u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGBOCTIS_OFF (0u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGFRMIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGFRMIS_OFF (21u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXGOCTIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXGOCTIS_OFF (20u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXLATCOLFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXLATCOLFIS_OFF (17u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGBFIS_OFF (11u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCGFIS_OFF (3u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXMCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS_OFF (15u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXOSIZEGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXOSIZEGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXOSIZEGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXOSIZEGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXOSIZEGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXOSIZEGFIS_OFF (25u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXPAUSFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXPAUSFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXPAUSFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXPAUSFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXPAUSFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXPAUSFIS_OFF (23u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXSCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXSCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXSCOLGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS_OFF (14u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUCGBFIS_LEN (1u)

