luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_STATUS_Bits.GLPII */
#define IFX_ETH_STATUS_GLPII_OFF (30u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.GMI */
#define IFX_ETH_STATUS_GMI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.GMI */
#define IFX_ETH_STATUS_GMI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.GMI */
#define IFX_ETH_STATUS_GMI_OFF (27u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.GPI */
#define IFX_ETH_STATUS_GPI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.GPI */
#define IFX_ETH_STATUS_GPI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.GPI */
#define IFX_ETH_STATUS_GPI_OFF (28u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.NIS */
#define IFX_ETH_STATUS_NIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.NIS */
#define IFX_ETH_STATUS_NIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.NIS */
#define IFX_ETH_STATUS_NIS_OFF (16u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.OVF */
#define IFX_ETH_STATUS_OVF_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.OVF */
#define IFX_ETH_STATUS_OVF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.OVF */
#define IFX_ETH_STATUS_OVF_OFF (4u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.RI */
#define IFX_ETH_STATUS_RI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.RI */
#define IFX_ETH_STATUS_RI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.RI */
#define IFX_ETH_STATUS_RI_OFF (6u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.RPS */
#define IFX_ETH_STATUS_RPS_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.RPS */
#define IFX_ETH_STATUS_RPS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.RPS */
#define IFX_ETH_STATUS_RPS_OFF (8u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.RS */
#define IFX_ETH_STATUS_RS_LEN (3u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.RS */
#define IFX_ETH_STATUS_RS_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.RS */
#define IFX_ETH_STATUS_RS_OFF (17u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.RU */
#define IFX_ETH_STATUS_RU_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.RU */
#define IFX_ETH_STATUS_RU_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.RU */
#define IFX_ETH_STATUS_RU_OFF (7u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.RWT */
#define IFX_ETH_STATUS_RWT_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.RWT */
#define IFX_ETH_STATUS_RWT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.RWT */
#define IFX_ETH_STATUS_RWT_OFF (9u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.TI */
#define IFX_ETH_STATUS_TI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.TI */
#define IFX_ETH_STATUS_TI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.TI */
#define IFX_ETH_STATUS_TI_OFF (0u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.TJT */
#define IFX_ETH_STATUS_TJT_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.TJT */
#define IFX_ETH_STATUS_TJT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.TJT */
#define IFX_ETH_STATUS_TJT_OFF (3u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.TPS */
#define IFX_ETH_STATUS_TPS_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.TPS */
#define IFX_ETH_STATUS_TPS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.TPS */
#define IFX_ETH_STATUS_TPS_OFF (1u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.TS */
#define IFX_ETH_STATUS_TS_LEN (3u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.TS */
#define IFX_ETH_STATUS_TS_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.TS */
#define IFX_ETH_STATUS_TS_OFF (20u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.TTI */
#define IFX_ETH_STATUS_TTI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.TTI */
#define IFX_ETH_STATUS_TTI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.TTI */
#define IFX_ETH_STATUS_TTI_OFF (29u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.TU */
#define IFX_ETH_STATUS_TU_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.TU */
#define IFX_ETH_STATUS_TU_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.TU */
#define IFX_ETH_STATUS_TU_OFF (2u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.UNF */
#define IFX_ETH_STATUS_UNF_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.UNF */
#define IFX_ETH_STATUS_UNF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.UNF */
#define IFX_ETH_STATUS_UNF_OFF (5u)

/** \brief  Length for Ifx_ETH_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_ETH_SUB_SECOND_INCREMENT_SSINC_LEN (8u)

/** \brief  Mask for Ifx_ETH_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_ETH_SUB_SECOND_INCREMENT_SSINC_MSK (0xffu)

/** \brief  Offset for Ifx_ETH_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_ETH_SUB_SECOND_INCREMENT_SSINC_OFF (0u)

/** \brief  Length for Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_LEN (16u)

/** \brief  Mask for Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MSK (0xffffu)

/** \brief  Offset for Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_OFF (0u)

/** \brief  Length for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_TSSS_LEN (31u)

/** \brief  Mask for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_TSSS_MSK (0x7fffffffu)

/** \brief  Offset for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_TSSS_OFF (0u)

/** \brief  Length for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_LEN (1u)

/** \brief  Mask for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_OFF (31u)

/** \brief  Length for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_LEN (31u)

/** \brief  Mask for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MSK (0x7fffffffu)

