luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_OFF (0u)

/** \brief  Length for Ifx_ETH_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_TSS_LEN (32u)

/** \brief  Mask for Ifx_ETH_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_TSS_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_TSS_OFF (0u)

/** \brief  Length for Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_UPDATE_TSS_LEN (32u)

/** \brief  Mask for Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_UPDATE_TSS_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_UPDATE_TSS_OFF (0u)

/** \brief  Length for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TRGTBUSY_LEN (1u)

/** \brief  Mask for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TRGTBUSY_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TRGTBUSY_OFF (31u)

/** \brief  Length for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TTSLO */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TTSLO_LEN (31u)

/** \brief  Mask for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TTSLO */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TTSLO_MSK (0x7fffffffu)

/** \brief  Offset for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TTSLO */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TTSLO_OFF (0u)

/** \brief  Length for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_LEN (32u)

/** \brief  Mask for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_OFF (0u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_LEN (32u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_OFF (0u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_OFF (25u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_OFF (26u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_OFF (27u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN3 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN3_OFF (28u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSFC */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSFC_OFF (24u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_LEN (2u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.SNAPTYPSEL */
#define IFX_ETH_TIMESTAMP_CONTROL_SNAPTYPSEL_OFF (16u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSADDREG_OFF (5u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCFUPDT_OFF (1u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSCTRLSSR_OFF (9u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENA_OFF (0u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_MSK (0x1u)

