luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENALL_OFF (8u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSENMACADDR */
#define IFX_ETH_TIMESTAMP_CONTROL_TSENMACADDR_OFF (18u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSEVNTENA_OFF (14u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSINIT_OFF (2u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPENA_OFF (11u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV4ENA_OFF (13u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSIPV6ENA_OFF (12u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSMSTRENA_OFF (15u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSTRIG */
#define IFX_ETH_TIMESTAMP_CONTROL_TSTRIG_OFF (4u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_ETH_TIMESTAMP_CONTROL_TSUPDT_OFF (3u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_ETH_TIMESTAMP_CONTROL_TSVER2ENA_OFF (10u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_LEN (5u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_MSK (0x1fu)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSNS */
#define IFX_ETH_TIMESTAMP_STATUS_ATSNS_OFF (25u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTM */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTM_OFF (24u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_LEN (4u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_MSK (0xfu)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.ATSSTN */
#define IFX_ETH_TIMESTAMP_STATUS_ATSSTN_OFF (16u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.AUXTSTRIG */
#define IFX_ETH_TIMESTAMP_STATUS_AUXTSTRIG_OFF (2u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSSOVF */
#define IFX_ETH_TIMESTAMP_STATUS_TSSOVF_OFF (0u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT1_OFF (4u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT2_OFF (6u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT3_OFF (8u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTARGT */
#define IFX_ETH_TIMESTAMP_STATUS_TSTARGT_OFF (1u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_MSK (0x1u)

