luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR1 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR1_OFF (5u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR2 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR2_OFF (7u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR3 */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR3_OFF (9u)

/** \brief  Length for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_LEN (1u)

/** \brief  Mask for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_TIMESTAMP_STATUS_Bits.TSTRGTERR */
#define IFX_ETH_TIMESTAMP_STATUS_TSTRGTERR_OFF (3u)

/** \brief  Length for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_LEN (30u)

/** \brief  Mask for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits.TDESLA */
#define IFX_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_TDESLA_OFF (2u)

/** \brief  Length for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_LEN (32u)

/** \brief  Mask for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits.TPD */
#define IFX_ETH_TRANSMIT_POLL_DEMAND_TPD_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.TX1024_MAXOCTGB */
#define IFX_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_TX1024_MAXOCTGB_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.TX128_255OCTGB */
#define IFX_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_TX128_255OCTGB_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.TX256_511OCTGB */
#define IFX_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_TX256_511OCTGB_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.TX512_1023OCTGB */
#define IFX_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_TX512_1023OCTGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits.TX64OCTGB */
#define IFX_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_TX64OCTGB_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.TX65_127OCTGB */
#define IFX_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_TX65_127OCTGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits.TXBCASTGB */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_TXBCASTGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits.TXBCASTG */
#define IFX_ETH_TX_BROADCAST_FRAMES_GOOD_TXBCASTG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits.TXCARR */
#define IFX_ETH_TX_CARRIER_ERROR_FRAMES_TXCARR_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_MSK (0xffffffffu)

